{
  "version": 1,
  "updatedAt": "2026-02-26T12:00:00Z",
  "items": [
    {
      "id": "2026-02-26-agency-beta",
      "title": "Agency & Creator Network features entering testing phase",
      "summary": "New agency-level dashboards, referral tracking, and performance tools are now in private testing. Public rollout coming soon.",
      "body": "As of February 26, 2026, we’ve officially entered the testing phase for Agency and Creator Network features inside Infinitum Creator Ledger.\n\nThis update introduces backend support and early-access tools designed specifically for agencies, managers, and creator networks. These features will allow structured referral tracking, performance-based insights, adoption monitoring, and network-level visibility across creator accounts.\n\nWe are currently running controlled testing to ensure accuracy, stability, and compliance across all supported regions before public release. During this phase, performance, attribution logic, subscription tracking, and reporting workflows are being validated to production standards.\n\nIf you're part of an agency or creator network, expanded capabilities are coming soon — including measurable performance scoring, referral-based revenue attribution, and network analytics designed to remove administrative friction.\n\nPublic production rollout will follow after testing is completed and verified.",
      "publishedAt": "2026-02-26T12:00:00Z",
      "linkUrl": ""
    },
    {
      "id": "2026-02-23-milestone-promo",
      "title": "Milestone rewards: free subscription for early supporters",
      "summary": "At 1K, 5K, 10K, 20K, and 50K users the first 1,000 get 1 month free. At 100K the first 100 get 1 year free. Check the live count here—one user per device.",
      "body": "We're celebrating growth with real rewards. When we hit 1,000 unique users (one per device), the first 1,000 get a free month. Same deal at 5,000, 10,000, 20,000, and 50,000: the first 1,000 at each milestone get 1 month free. When we reach 100,000 users, the first 100 get one year free. Share the app with other creators and watch the live creator count on this News page—only one user per device counts, so every share matters. Promo codes will be shared in-app and via our channels as we hit each milestone.",
      "publishedAt": "2026-02-23T12:00:00Z",
      "linkUrl": ""
    },
    {
      "id": "2026-02-22-launch",
      "title": "Infinitum Creator Ledger has launched",
      "summary": "Infinitum Creator Ledger is now available. Track LIVEs, earnings, and exports in one place.",
      "body": "On February 22, 2026, Infinitum Creator Ledger launched. Use the app to log your LIVE streams, track earnings, and export data from Export Center for taxes and reporting. Thank you for being part of the launch.",
      "publishedAt": "2026-02-22T12:00:00Z",
      "linkUrl": ""
    }
  ]
}
